/*4_5.程式能力檢定題庫-題目難度 [*]-發鈔票(100.0)*/
#include <bits/stdc++.h>
//#include <iostream>
using namespace std;
int main() {
    int money;
    while(cin>>money){
        int N[5]={0,0,0,0,money/100};
        money%=100;
        N[3]=money/50;
        money%=50;
        N[2]=money/10;
        money%=10;
        N[1]=money/5;
        money%=5;
        N[0]=money;
        cout<<"1-"<<N[0]<<", 5-"<<N[1]<<", 10-"<<N[2]
        <<", 50-"<<N[3]<<", 100-"<<N[4]<<endl;
    }
   return 0;
}
/*
一、程式範例描述：

某國共發行了 1,5,10,50,100 不同面額的鈔票，若有人要從銀行領出 N 元，銀行行員要如何發給鈔票，則使用的張數會最少。


二、輸入說明：

正整數。



三、輸出說明：
1-N1, 5-N2, 10-N3, 50-N4, 100-N5。 (N1, N2, N3, N4, N5 為大於等於零的整數)



四、輸入範例：
478
1022
555


五、輸出範例：
1-3, 5-1, 10-2, 50-1, 100-4
1-2, 5-0, 10-2, 50-0, 100-10
1-0, 5-1, 10-0, 50-1, 100-5
*/
